<h1 align="center">Pandas in python</h1> 

- **Pandas is a open source library built on top of numpy.**
- **It allows for fast analysis and data cleaning and preparation.**
- **It excels in performance and productivity.**
- **It also has built-in visualization features.**
- **It can work with data from wide variety of sources.**

In [106]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /home/clecotech/.local/lib/python3.6/site-packages (1.1.5)
Requirement already satisfied: pytz>=2017.2 in /usr/lib/python3/dist-packages (from pandas) (2018.3)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/clecotech/.local/lib/python3.6/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.7.3->pandas) (1.11.0)
Note: you may need to restart the kernel to use updated packages.

<h1 align="center">Series</h1>

In [183]:
import pandas as pd
import numpy as np

###  # Series Creation - using different different data type.

In [184]:
label=["a","b","c"] #list of strings
data=[1,2,3] #list of numbers
d={"a":1,"b":2,"c":3} #dictionary
arr=np.array(data) #numpy array using list

In [185]:
pd.Series(label) #series using label list

0    a
1    b
2    c
dtype: object

In [186]:
pd.Series(data) #series using data list

0    1
1    2
2    3
dtype: int64

In [187]:
pd.Series(d) #series using dictionary

a    1
b    2
c    3
dtype: int64

In [112]:
pd.Series(arr) #series using numpy array

0    1
1    2
2    3
dtype: int64

In [113]:
pd.Series(data=data, index=label) #series using data and label passed

a    1
b    2
c    3
dtype: int64

<div class="alert alert-block alert-warning">
<b>Important:</b> pandas Series can hold variety of object type. example given below !</div>

In [114]:
data=["s",1,2,2.2]
pd.Series(data)

0      s
1      1
2      2
3    2.2
dtype: object

###  # Accessing Series Element  - using different different data type.

<div class="alert alert-block alert-success">
<b>Note:</b> Pandas Series uses key value pair for fast lookups, it works like hashtable and dictionary.
</div>

In [115]:
series1= pd.Series([4,5,6,7,8] ,["a","s","d","f","g"])
series1

a    4
s    5
d    6
f    7
g    8
dtype: int64

In [116]:
series2= pd.Series([1,2,3,4,5] ,["z","x","d","f","g"])
series2

z    1
x    2
d    3
f    4
g    5
dtype: int64

In [117]:
series1["a"] #accessing element is same as dictionaries

4

In [118]:
series2["x"]

2

In [119]:
series1+series2 #basic operations

a     NaN
d     9.0
f    11.0
g    13.0
s     NaN
x     NaN
z     NaN
dtype: float64

<div class="alert alert-block alert-warning">
<b>Important:</b> Pandas and Numpy convert number to float in order to retain all the information.
</div>

<h1 align="center">DataFrames</h1>

###  # Series Creation - using different different data type.

In [120]:
from numpy.random import randn

In [121]:
np.random.seed(101)

In [122]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [123]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #parameters are :data, index, column_name

In [124]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

###  # Indexing & Selection

In [125]:
df['W'] #getting column W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [126]:
type(df['W'])

pandas.core.series.Series

In [127]:
type(df)

pandas.core.frame.DataFrame

In [128]:
 df.W #another way of indexing df.<column_name>

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [129]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

<div class="alert alert-block alert-warning">
<b>important:</b> If we call a single column we get Series and if we call multiple column we get DataFrame
</div>

- **Column addition in df**

In [130]:
df['new']=df['W']+df['Z'] #adding column

In [131]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

- **Column deletion in df**

In [132]:
df.drop('new',1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [133]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [134]:
#original data is not affected as seen above

In [135]:
# pandas do this coz to avoid accident data deletion and ,
# to do we have to pass inplace=True parameter

In [136]:
df.drop('new',1,inplace=True)

In [137]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [138]:
df.drop('E') #no axis parameter required as by default axis=0

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [139]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [140]:
df.shape

(5, 4)

In [141]:
# it is just numpy array of size 5X4 so 5 is axis=0 and 4 is axis=1

In [142]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [143]:
df.loc['A'] #to access row A we use loc[<label>] label based selection

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [144]:
#rows are also Series

In [145]:
df.iloc[0] #to access row using numerical based index.

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [146]:
# getting single element
    
df.loc['A','W'] #row,column

0.3026654485851825

In [147]:
# subset printing

df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

- **Conditional data selection**

In [148]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [149]:
df>0 # same as numpy arrays

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [150]:
booldf=df>0

In [151]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [152]:
df[df['W']>0] #outputs entire row where column W is true.

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [153]:
#to accesss only x cloumn after filter 

df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [154]:
#to accesss multiple cloumns after filter 

df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [155]:
#using or and and operator

df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

<div class="alert alert-block alert-danger">
<b>Error:</b> We can't use 'and' and 'or' operator of python because 
    it can not perform operation between two series so instead 
    we use '|' for or and '&' for and operators.
</div>

- ### reset_index()- to reset index to a numerical value

In [156]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [157]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

- ### making a new column as index using set_index() method.

In [158]:
new_col=" AS SD DF GH HJ".split() #spliting string to list

In [159]:
df['new_col']=new_col #adding new_col to df

In [160]:
df

          W         X         Y         Z new_col
A  0.302665  1.693723 -1.706086 -1.159119      AS
B -0.134841  0.390528  0.166905  0.184502      SD
C  0.807706  0.072960  0.638787  0.329646      DF
D -0.497104 -0.754070 -0.943406  0.484752      GH
E -0.116773  1.901755  0.238127  1.996652      HJ

In [161]:
df.set_index('new_col') #set_index(<column name>)

                W         X         Y         Z
new_col
AS       0.302665  1.693723 -1.706086 -1.159119
SD      -0.134841  0.390528  0.166905  0.184502
DF       0.807706  0.072960  0.638787  0.329646
GH      -0.497104 -0.754070 -0.943406  0.484752
HJ      -0.116773  1.901755  0.238127  1.996652

<div class="alert alert-block alert-warning">
<b>Important:</b> set_index() vs reset_index() difference
</div>

###  # Multi Indexed DataFrame

In [162]:
outside=["G1", "G1", "G1", "G2", "G2", "G2"]
inside=[1,2,3,1,2,3]
heir_index=list(zip(outside,inside))
heir_index=pd.MultiIndex.from_tuples(heir_index)

In [163]:
heir_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [164]:
df=pd.DataFrame(randn(6,2),heir_index,["A","B"])

In [165]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

###  # Accessing DataFrame elements.

In [166]:
df.loc["G1"] #using loc[]

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [167]:
df.loc["G1"].loc[1] #using loc[] then in loc[]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [168]:
df.loc["G1"].loc[1].loc["A"] #using loc[] then in loc[] then in loc[]

-0.993263499973366

**# Order to access element is Outside >> Inside >> In Inside.**

In [169]:
df.index.names

FrozenList([None, None])

In [170]:
df.index.names=["Groups","Num"]

In [171]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [172]:
df.loc["G1"].loc[2].loc["B"]

0.000366479605643592

In [173]:
# xs()function

df.xs(1,level="Num")

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

<h1 align="center">Missing Data</h1>

In [174]:
d={"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [175]:
df=pd.DataFrame(d)

In [176]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

###  # dropna() - to drop null values row and col.

In [177]:
df.dropna()  #axis=0

     A    B  C
0  1.0  5.0  1

In [178]:
df.dropna(axis=1) #axis=1

   C
0  1
1  2
2  3

In [179]:
df.dropna(thresh=2) #threshold parameter

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

###  # fillna() - to fill null values.

In [180]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [181]:
df.fillna(value="fill value") #to fill value in DataFrame

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [182]:
df["A"].fillna(value=df["A"].mean()) #to fill in a desired row

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

<h1 align="center">Groupby method</h1> 

**groupby allows us to group together rows based off of a column and perform the aggregate function on them.**
<br>
**aggregate function takes multiple values and outputs a single value as result**

In [206]:
data = {
    "company": ["abc", "abc", "google", "google", "amazon", "clecotech"],
    "sales": [14, 58, 69, 8, 9, 47],
    "person": ["ra", "hel", "fog", "hog", "my", "jar"]
}
df = pd.DataFrame(data)
df

     company  sales person
0        abc     14     ra
1        abc     58    hel
2     google     69    fog
3     google      8    hog
4     amazon      9     my
5  clecotech     47    jar

In [196]:
byComp=df.groupby("company")
byComp.mean()

           sales
company
abc         36.0
amazon       9.0
clecotech   47.0
google      38.5

In [192]:
byComp.sum()

           sales
company
abc           72
amazon         9
clecotech     47
google        77

In [193]:
byComp.std()

               sales
company
abc        31.112698
amazon           NaN
clecotech        NaN
google     43.133514

In [195]:
byComp.sum().loc['abc']

sales    72
Name: abc, dtype: int64

In [197]:
df

     company  sales person
0        abc     14     ra
1        abc     58    hel
2     google     69    fog
3     google      8    hog
4     amazon      9     my
5  clecotech     47    jar

In [198]:
df.groupby("sales").sum()

         company person
sales
8         google    hog
9         amazon     my
14           abc     ra
47     clecotech    jar
58           abc    hel
69        google    fog

In [199]:
df.groupby("sales").sum().loc[8]

company    google
person        hog
Name: 8, dtype: object

In [200]:
df.groupby("sales").count()

       company  person
sales
8            1       1
9            1       1
14           1       1
47           1       1
58           1       1
69           1       1

In [201]:
df.groupby("company").describe()

          sales
          count  mean        std   min    25%   50%    75%   max
company
abc         2.0  36.0  31.112698  14.0  25.00  36.0  47.00  58.0
amazon      1.0   9.0        NaN   9.0   9.00   9.0   9.00   9.0
clecotech   1.0  47.0        NaN  47.0  47.00  47.0  47.00  47.0
google      2.0  38.5  43.133514   8.0  23.25  38.5  53.75  69.0

In [202]:
df.groupby("company").describe().transpose()

company            abc  amazon  clecotech     google
sales count   2.000000     1.0        1.0   2.000000
      mean   36.000000     9.0       47.0  38.500000
      std    31.112698     NaN        NaN  43.133514
      min    14.000000     9.0       47.0   8.000000
      25%    25.000000     9.0       47.0  23.250000
      50%    36.000000     9.0       47.0  38.500000
      75%    47.000000     9.0       47.0  53.750000
      max    58.000000     9.0       47.0  69.000000

In [203]:
df.groupby("company").describe().transpose()["clecotech"]

sales  count     1.0
       mean     47.0
       std       NaN
       min      47.0
       25%      47.0
       50%      47.0
       75%      47.0
       max      47.0
Name: clecotech, dtype: float64

<h1 align="center">Merging Joining And Concatenation</h1>